package com.arc.zero.controller.data.file.test;

import lombok.val;

/**
 * @author yechao
 * @date 2020/12/8 4:56 下午
 */
public class TestLen {

    public static void main(String[] args) {
        val rule = "淘金币夺宝规则\n" +
                "一、参与条件\n" +
                "淘宝注册用户，且用户的淘宝会员账号所绑定的支付宝账号须通过实名认证，并开启金币庄园玩法。\n" +
                "二、参与方式\n" +
                "活动期间，用户通过登入“手机淘宝-领淘金币”进入“金币夺宝”活动页面，即可根据页面指示参与活动。\n" +
                "三、活动玩法细则\n" +
                "1. 所有授权用户可选择喜欢的商品（可多选）支付淘金币，获取夺宝号并参与夺宝。\n" +
                "2. 每人每次参与需消耗100淘金币兑换一个夺宝号，投注成功后，所消耗淘金币不予退还。\n" +
                "3. 宝贝奖池所需淘金币总数集满后，将于当日21:00开奖；如当天21:00前未集满，则顺延至下一天，直到淘金币集满为止。\n" +
                "4. 部分惊喜宝贝奖池开奖所需淘金币总数集满后，次日00:10开奖；如次日00:10前未集满，则顺延至下一天，直到淘金币集满为止。\n" +
                "5. 中奖信息及奖品请在“淘金币夺宝-我的奖品”页中查看。\n" +
                "6. 中奖后用户务必在72小时内点击“领取宝贝”填写完整奖品收货信息（手机号用于接收奖品券码），逾期作废。\n" +
                "7. 中奖奖品由阿里体育提供，将在用户填写收货信息成功后的7个工作日内发放。\n" +
                "8. 本活动仅限中国大陆地区用户参与。\n" +
                "四、注意事项\n" +
                "1．淘金币相关规则可查询 https://coin.bbs.taobao.com/detail.html?postId=6578743\n" +
                "2. 在参与夺宝和领取奖品过程中，如用户出现违规行为（如作弊领取、恶意套现、刷取信誉、虚假交易等），淘宝将取消违规用户的获取资格，并有权利撤销违规交易，收回全部权益（含已使用和未使用的），必要时追究法律责任。\n" +
                "3. 活动期间如出现不可抗力或情势变更的情况（包括但不限于重大灾害事件、活动受政府机关指令需要停止举办或调整的、活动遭受严重网络攻击或因系统故障需要暂停举办的），淘宝可依相关法律法规的规定主张免责。\n" +
                "4. 某些国家和地区的法律法规对参与和举办以随机性的方法决定用户可能获得奖励的营销活动（例如抽奖、抢红包、抢特定优惠秒杀商品等）有限制性规定，故此类营销活动只限位于该等国家和地区外的消费者参与。提醒居住于受限制国家或者地区的消费者请勿参与此类营销活动。\n" +
                "5. 淘宝及阿里体育可在相关法律法规允许的范围内，根据本活动的实际举办情况对活动规则进行解释、变动或调整，相关变动或调整将公布在活动页面上，公布后依法生效。\n" +
                "6. 用户参与活动时，还应遵守《天猫官方营销活动通用用户规则》请点此查看\n" +
                "https://pages.tmall.com/wow/rules/act/yonghuguize?wh_biz=tm\n";
        System.out.println(rule.length());
        System.out.println(1024*3);

    }
}
